# Solutions for LeetCode Database Problems, using Pandas

## 180. Consecutive Numbers

In [11]:
import pandas as pd


# read csv file
df = pd.read_csv('Logs.csv')

# create a column to count consecutive numbers
df['ConNum'] = 0

# count consecutive number by 
count = 1
for i, num in enumerate(df['Num']):
    if i == 0:
        df['ConNum'][i] = count
    else:
        if df['Num'][i] == df['Num'][i-1]:
            count += 1
            df['ConNum'][i] = count
        else:
            count = 1
            df['ConNum'][i] = count

df[df['ConNum']==3]

   Id  Num  ConNum
2   3    1       3

## 184. Department Highest Salary

In [34]:
# complicated because I should select indices and use groupby and transform function to select!!!

# Find employees who have the highest salary in each of the departments
# Return the table following order of columns: Department, Employee, Salary

# What patterns we have here in this problem?

import pandas as pd

df = pd.read_csv('EmployeeSalary.csv')
df

department = pd.read_csv('Department.csv')
department

# merge two csv files on DepartmentId
result = pd.merge(df, department, left_on=['DepartmentId'], right_on=['Id'])
result

   Id_x Name_x  Salary  DepartmentId  Id_y Name_y
0     1    Joe   70000             1     1     IT
1     2    Jim   90000             1     1     IT
2     5    Max   90000             1     1     IT
3     3  Henry   80000             2     2  Sales
4     4    Sam   60000             2     2  Sales

In [35]:
#solution 1: using indices we want

result2 = result[['Name_y', 'Name_x', 'Salary']]
result2.columns = ['Department', 'Employee', 'Salary']
idx = result2.groupby(['Department'])['Salary'].transform(max) == result2['Salary']
final = result2[idx]
final

  Department Employee  Salary
1         IT      Jim   90000
2         IT      Max   90000
3      Sales    Henry   80000

In [50]:
# solution 2: creating another column 
# including max value by department and slicing with conditions(salary = max_salary)

result2['Department_max'] = result2.groupby('Department')['Salary'].transform(max)
final = result2[result2['Department_max']==result2['Salary']]
final.drop('Department_max', axis=1)

<ipython-input-50-13c937212e80>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result2['Department_max'] = result2.groupby('Department')['Salary'].transform(max)

  Department Employee   Salary
1         IT      Jim  90000.0
2         IT      Max  90000.0
3      Sales    Henry  80000.0

## 177. Nth Highest Salary

In [12]:
import pandas as pd

# read csv file
df = pd.read_csv('Employee2.csv')

# nth highest salary that we want
n = 2

# sort by Salary and output the nth highest salary by using iloc functiona
df.sort_values('Salary', ascending=True).iloc[n-1]

Id          2
Salary    200
Name: 1, dtype: int64

## 626. Exchange Seats

In [28]:
# change seats for the adjacent students

import pandas as pd

df = pd.read_csv('seat.csv')
df['student2'] = 0
for i in range(len(df['student'])):
    if i % 2 == 0:
        if i == len(df['student'])-1:
            df.loc[i, 'student2'] = df.loc[i, 'student']
        else:
            df.loc[i, 'student2'] = df.loc[i+1, 'student']
        if i % 2 == 1:
            df.loc[i, 'student2'] = df.loc[i-1, 'student']

df.columns = ['Id', 'Student', 'Exchanged Seat']
df[['Id', 'Exchanged Seat']]

   Id Exchanged Seat
0   1          Doris
1   2              0
2   3          Green
3   4              0
4   5         Jeames

## 197. Rising Temperature

In [24]:
# find all dates'id with higher temperature compared to its previous dates

import pandas as pd

df = pd.read_excel('RisingTemperature.xlsx')
df['DiffTemp'] = 0
for i, temp in enumerate(df['Temperature']):
    if i != 0:
        df.loc[i, 'DiffTemp'] = temp - df.loc[i-1, 'Temperature']

df[df['DiffTemp']>0]

   id recordDate  Temperature  DiffTemp
1   2 2015-01-02           25        15
3   4 2015-01-04           30        10

## 596. Classes More Than 5 Students

In [17]:
# list out all classes which have more than or equal to 5 students

import pandas as pd

df = pd.read_csv('courses.csv')
result = df.groupby('class').agg('count')
result[result['student']>=5].reset_index()

  class  student
0  Math        6

## 178. Rank Scores

In [23]:
# If two scores are the same, both should be the same ranking.
# The next score has the next ranking, meaning that there is no hole between rankings

import pandas as pd

df = pd.read_csv('scores.csv')
df = df.sort_values('Score', ascending=False).reset_index(drop=True)
rank = 1
for i in range(len(df)):
    if i == 0:
        df['Rank'] = rank
    if i > 0:
        if df.loc[i, 'Score'] == df.loc[i-1, 'Score']:
            df.loc[i, 'Rank'] = rank
        else:
            rank += 1
            df.loc[i, 'Rank'] = rank
#    if i > 0 and df['Score'][i] == df['Score'][i-1]:
#       df['rank'][i] = rank

df[['Score', 'Rank']]

   Score  Rank
0   4.00     1
1   4.00     1
2   3.85     2
3   3.65     3
4   3.65     3
5   3.50     4

## 601. Human Traffic of Stadium

Question: Display the records with three or more rows with consecutive id's in which the number of people is greater than or equal to 100 for each. And, return the result table ordered by `visit_date` in ascending order.

In [34]:
# No two rows have the same date and the date increases as the id increases.

import pandas as pd

# read csv file
df = pd.read_csv('Stadium.csv')

# count consecutive id's of more than 100 people
df['Above100'] = 0
count = 0
for i, num in enumerate(df['people']):
    if num >= 100 and df.loc[i, 'id'] == df.loc[i-1, 'id'] + 1:
        count += 1
        df.loc[i, 'Above100'] = count
    else:
        count = 0
        
df

   id visit_date  people  Above100
0   1     1/1/17      10         0
1   2     1/2/17     109         1
2   3     1/3/17     150         2
3   4     1/4/17      99         0
4   5     1/5/17     145         1
5   6     1/6/17    1455         2
6   7     1/7/17     199         3
7   8     1/9/17     188         4

In [36]:
# assign a new group whenever we encounter nonzero number,
# which means that the number of group increases by one as we encounter zero
df['Group'] = 0
group = 0
for i, num in enumerate(df['Above100']):
    if num == 0:
        df.loc[i, 'Group'] = 0
        group += 1
    else:
        df.loc[i, 'Group'] = group

# we compute the max consecutive id by group with max transformation
df['GroupCon'] = df.groupby('Group')['Above100'].transform(max)

# given the condition of GroupCon which is greater than or equal to 3, we can display the answer of this question
df[df['GroupCon']>=3][['id', 'visit_date', 'people']]

   id visit_date  people
4   5     1/5/17     145
5   6     1/6/17    1455
6   7     1/7/17     199
7   8     1/9/17     188

## 185. Department Top Three Salaries

Question: find employees who earn the top three salaries in each of the department. The result should have three columns in this order - Department, Employee, Salary

In [2]:
import pandas as pd

df = pd.read_csv('Employee3.csv')
department = pd.read_csv('Department2.csv')

intermediate_result = df.merge(department, left_on='DepartmentId', right_on='Id')
intermediate_result = intermediate_result.drop(['Id_x', 'DepartmentId', 'Id_y'], axis = 1)
intermediate_result.columns = ['Employee', 'Salary', 'Department']
intermediate_result.sort_values(['Department'])

  Employee  Salary Department
0      Joe   85000         IT
1      Max   90000         IT
2    Janet   69000         IT
3    Randy   85000         IT
4     Will   70000         IT
5    Henry   80000      Sales
6      Sam   60000      Sales

In [4]:
result = intermediate_result.sort_values(['Department', 'Salary'], ascending=[True, False]).groupby('Department').head(3)
result

  Employee  Salary Department
1      Max   90000         IT
0      Joe   85000         IT
3    Randy   85000         IT
5    Henry   80000      Sales
6      Sam   60000      Sales

## 262. Trips and Users

Question: find the cancellation rate of requests made by unbanned users (both client and driver must be unbanned) between Oct 1, 2013 and Oct 3, 2013. The cancellation rate is computed by dividing the number of cancelled requests made by users by the total number of requests made by unbanned users.

In [84]:
import pandas as pd

trip = pd.read_csv('Trips.csv')
user = pd.read_csv('Users.csv')
client = user[user['Role']=='client'].drop(columns = 'Role')
driver = user[user['Role']=='driver'].drop(columns = 'Role')

inter_result = trip.merge(client, left_on='Client_Id', right_on='User_Id', suffixes=['','_client'])
inter_result = inter_result.merge(driver, left_on='Driver_Id', right_on='User_Id', suffixes=['','_driver'])
inter_result = inter_result[(inter_result['Request_at']>= '2013-10-01') &
                            (inter_result['Request_at']<= '2013-10-03') &
                            (inter_result['Banned']=='No') &
                            (inter_result['Banned_driver']=='No')]
result = inter_result.groupby(['Request_at', 'Status']).agg({'Id': 'count'})
result = result.groupby(level=0).apply(lambda x: round(x/x.sum(), 2)).reset_index()
result = result[result['Status']=='completed']
result['Id'] = 1 - result['Id']
result = result.drop(columns='Status')
result.columns = ['Day', 'Cancellation Rate']
result

          Day  Cancellation Rate
1  2013-10-01               0.33
2  2013-10-02               0.00
4  2013-10-03               0.50